{
  "categories": [
    {
      "id": "daily-rhythm",
      "title": "Daily Rhythm SOS",
      "description": "Repair routines quickly when schedules wobble or confidence dips.",
      "keywords": ["potty", "schedule", "crate", "alone", "routine", "crying", "accident"],
      "items": [
        {
          "id": "potty-accident-reset",
          "title": "Potty Accident Reset",
          "summary": "Reboot the bathroom plan after surprise puddles indoors.",
          "doNow": "Clip the leash, walk directly to the original potty zone, and reward with a rapid treat trio the instant the puppy finishes outside.",
          "prevent": "Log wake, meal, and play times for three days so you can pre-empt breaks 10 minutes earlier than the last accident.",
          "trainerTip": "Treat potty breaks like a mini mission—no sniff walks until after success so the cue sequence stays crystal clear.",
          "relatedLessons": [
            { "id": "potty_routine", "title": "Potty Spot Routine", "weekId": "week08" },
            { "id": "crate_love_1", "title": "Crate = Cozy Den", "weekId": "week08" }
          ]
        },
        {
          "id": "crate-protest",
          "title": "Crate Protest Calmer",
          "summary": "Lower the volume when puppies bark or dig at the crate door.",
          "doNow": "Load a lick mat, cover three crate sides, and sit nearby breathing slowly until your puppy settles, then release before they escalate again.",
          "prevent": "Schedule crate reps after potty + play so tired bodies are ready to nap, and stick with short 2–3 minute sessions before stretching time.",
          "trainerTip": "Alternate crate locations each day—mobility keeps puppies from pairing the crate with only bedtime separation.",
          "relatedLessons": [
            { "id": "crate_love_1", "title": "Crate = Cozy Den", "weekId": "week08" },
            { "id": "crate_love_2", "title": "Crate Comfort Boost", "weekId": "week11" }
          ]
        },
        {
          "id": "alone-time-cry",
          "title": "Alone-Time Tears",
          "summary": "Support puppies who cry the moment you step out of sight.",
          "doNow": "Give a stuffed chew, start a one-minute timer, and return with a calm treat drop before the first whine crests so confidence stays intact.",
          "prevent": "Mix in decoy departures—grab keys, sit back down—to break the pattern that every cue predicts leaving.",
          "trainerTip": "Track the exact second your puppy vocalizes so you can build a predictable ladder of easy wins before extending duration.",
          "relatedLessons": [
            { "id": "alone_time_1", "title": "60-Second Alone Reps", "weekId": "week09" },
            { "id": "crate_love_2", "title": "Crate Comfort Boost", "weekId": "week11" }
          ]
        }
      ]
    },
    {
      "id": "behavior-resets",
      "title": "Behavior Resets",
      "description": "Quick triage plans for the most common puppy SOS moments.",
      "keywords": ["biting", "barking", "jumping", "chewing", "doorbell", "greetings"],
      "items": [
        {
          "id": "biting-witching-hour",
          "title": "Evening Biting Spikes",
          "summary": "Redirect shark teeth during the pre-bed zoomie hour.",
          "doNow": "Swap hands for a tug toy immediately, cue trade after 10 seconds, and end the game for a 20-second calm break if teeth land on skin twice.",
          "prevent": "Schedule a sniffy walk + scatter feed before the usual witching hour so arousal is already on its way down.",
          "trainerTip": "Narrate \"take your toy\" every time you present it—consistent language speeds up redirected grabs.",
          "relatedLessons": [
            { "id": "gentle_mouth_1", "title": "Gentle Mouth Swaps", "weekId": "week08" },
            { "id": "trade_game", "title": "Trade Game", "weekId": "week11" }
          ]
        },
        {
          "id": "barking-doorbell",
          "title": "Doorbell Bark Plan",
          "summary": "Lower alert barking when new sounds happen.",
          "doNow": "Scatter 10 treats on a mat as soon as barking starts, breathe with your puppy, then cue an easy sit before opening the door again.",
          "prevent": "Run two fake doorbell sessions daily pairing the chime with treat scatters so the bell predicts snacks, not chaos.",
          "trainerTip": "Record and replay real household sounds at low volume during meals to keep sub-threshold exposure going.",
          "relatedLessons": [
            { "id": "sound_socialization", "title": "Sound Socialization Mix", "weekId": "week09" },
            { "id": "calm_greetings_1", "title": "Calm Greeting Protocol", "weekId": "week12" }
          ]
        },
        {
          "id": "jumping-greetings",
          "title": "Jumping Greetings",
          "summary": "Teach four-on-the-floor manners when people walk in.",
          "doNow": "Cue sit on a mat before the helper approaches; if paws lift, have the helper pivot away until the puppy lands back in a sit.",
          "prevent": "Have visitors toss treats behind the puppy as they enter so spinning to chase replaces leaping straight ahead.",
          "trainerTip": "Install a hand-target cue and use it as the first request when friends arrive—giving paws a job keeps them grounded.",
          "relatedLessons": [
            { "id": "sit", "title": "Sit Anywhere", "weekId": "week09" },
            { "id": "calm_greetings_1", "title": "Calm Greeting Protocol", "weekId": "week12" }
          ]
        },
        {
          "id": "chewing-sneak",
          "title": "Furniture Chew Patrol",
          "summary": "Offer legal outlets before chair legs become toys.",
          "doNow": "Leash to you, park on a mat with a tethered chew, and reward every glance back to you for five minutes.",
          "prevent": "Rotate three textures daily and store chews out of reach so novelty stays high when you present them.",
          "trainerTip": "Practice leave-it with real household objects on leash walks so disengaging becomes the default response.",
          "relatedLessons": [
            { "id": "leave_it_1", "title": "Leave-It Foundations", "weekId": "week10" },
            { "id": "handling_intro", "title": "Handling Happy Hour", "weekId": "week08" }
          ]
        }
      ]
    },
    {
      "id": "focus-movement",
      "title": "Focus & Movement",
      "description": "Keep brains engaged during training, walks, and multi-pet moments.",
      "keywords": ["focus", "zoomies", "leash", "walk", "multi-pet", "energy"],
      "items": [
        {
          "id": "focus-scatter",
          "title": "Can't Focus On You",
          "summary": "Boost engagement when puppies stare at everything except their human.",
          "doNow": "Play a 30-second name game burst, feeding any head turn toward you, then reset with a toss behind you so they choose to reorient.",
          "prevent": "Keep sessions to five reps and end before interest dips; sprinkle surprise recall games through the day instead of marathon practices.",
          "trainerTip": "Track the rooms or yards with the best focus so you can increase difficulty only when your puppy is ready.",
          "relatedLessons": [
            { "id": "name_game", "title": "Name-Game Check Ins", "weekId": "week08" },
            { "id": "recall_1", "title": "Ping-Pong Recall", "weekId": "week11" }
          ]
        },
        {
          "id": "leash-zoomies",
          "title": "Leash Zoomies",
          "summary": "Handle pulling and hopping at the end of the leash.",
          "doNow": "Plant your feet the second the leash tightens, cue touch when your puppy glances back, and feed at your pant seam before moving again.",
          "prevent": "Run two-minute figure eights indoors before every walk so muscles remember the loose-leash pattern.",
          "trainerTip": "Pair harness time with sniff walks; if gear predicts freedom, puppies volunteer to gear up calmly.",
          "relatedLessons": [
            { "id": "harness_intro", "title": "Harness Happy Dance", "weekId": "week12" },
            { "id": "leash_indoors_1", "title": "Indoor Loose-Leash Figure Eights", "weekId": "week12" }
          ]
        },
        {
          "id": "multi-pet-intro",
          "title": "Other-Pet Introductions",
          "summary": "Keep greetings with resident cats or dogs chill and safe.",
          "doNow": "Gate the puppy, toss treats for looking at the resident pet, then cue an easy sit before releasing pressure.",
          "prevent": "Give each species escape routes and run scent-swaps before face-to-face time so novelty drops.",
          "trainerTip": "End while both animals are still relaxed—success is short, sweet exposure, not full play on day one.",
          "relatedLessons": [
            { "id": "cat_intro_1", "title": "Calm Cat Intro (Optional)", "weekId": "week10" },
            { "id": "hand_touch", "title": "Target Hand Touch", "weekId": "week09" }
          ]
        }
      ]
    }
  ]
}
